---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.IsDone
source: html/ccc7e176-c815-4a6e-421c-287116f29a30.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.